app/controllers/dados_controller.rb

SELECT "dados".* FROM "dados"
---
  def index
    @dados = Dado.all

INSERT INTO "dados" ("nome", "sobrenome", "cpf", "sexo", "email", "pagamento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @dado = Dado.new(dado_params)

    respond_to do |format|
      if @dado.save

SELECT  "dados".* FROM "dados" WHERE "dados"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_dado
      @dado = Dado.find(params[:id])